Revit 2027 API
Panel.Lockable Property
This property is used to know whether a panel can be locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Lockable { get; }
Public ReadOnly Property Lockable As Boolean
	Get
public:
property bool Lockable {
	bool get ();
}
member Lockable : bool with get
Property Value
Boolean
Remarks
If the panel can be locked, return true, else false.
See Also
Reference
Panel Class
Autodesk.Revit.DB Namespace